packages/windninjapy/windninjapy-0.0.3-cp39-cp39-macosx_10_14_x86_64.macosx_14_0_arm64.whl/windninjapy/data/ninjafoam/9/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    For specified fields, writes out the initial residuals for the first
    solution of each time step; for non-scalar fields (e.g. vectors), writes
    the largest of the residuals for each component (e.g. x, y, z).

\*---------------------------------------------------------------------------*/

type            residuals;
libs            ("libutilityFunctionObjects.so");

writeControl    timeStep;
writeInterval   1;

fields (epsilon k p U);

// ************************************************************************* //
